# Ordinal Encoding

In [ ]:
import datetime

In [6]:
today_date=datetime.datetime.today()

In [7]:
my_dates=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [8]:
my_dates

[datetime.datetime(2020, 7, 16, 6, 48, 47, 347431),
 datetime.datetime(2020, 7, 15, 6, 48, 47, 347431),
 datetime.datetime(2020, 7, 14, 6, 48, 47, 347431),
 datetime.datetime(2020, 7, 13, 6, 48, 47, 347431),
 datetime.datetime(2020, 7, 12, 6, 48, 47, 347431),
 datetime.datetime(2020, 7, 11, 6, 48, 47, 347431),
 datetime.datetime(2020, 7, 10, 6, 48, 47, 347431),
 datetime.datetime(2020, 7, 9, 6, 48, 47, 347431),
 datetime.datetime(2020, 7, 8, 6, 48, 47, 347431),
 datetime.datetime(2020, 7, 7, 6, 48, 47, 347431),
 datetime.datetime(2020, 7, 6, 6, 48, 47, 347431),
 datetime.datetime(2020, 7, 5, 6, 48, 47, 347431),
 datetime.datetime(2020, 7, 4, 6, 48, 47, 347431),
 datetime.datetime(2020, 7, 3, 6, 48, 47, 347431),
 datetime.datetime(2020, 7, 2, 6, 48, 47, 347431)]

In [9]:
import pandas as pd

In [11]:
data=pd.DataFrame(my_dates)
data.columns=['Day']

In [13]:
data.head()

                         Day
0 2020-07-16 06:48:47.347431
1 2020-07-15 06:48:47.347431
2 2020-07-14 06:48:47.347431
3 2020-07-13 06:48:47.347431
4 2020-07-12 06:48:47.347431

In [199]:
data['Day_Names']=data['Day'].dt.day_name()

In [164]:
data.head()

                         Day  Day_Names
0 2020-07-16 06:48:47.347431   Thursday
1 2020-07-15 06:48:47.347431  Wednesday
2 2020-07-14 06:48:47.347431    Tuesday
3 2020-07-13 06:48:47.347431     Monday
4 2020-07-12 06:48:47.347431     Sunday

In [165]:
days_in_a_week=list(data['Day_Names'].unique())

In [176]:
from calendar import weekday, day_name

In [181]:
day_name[1]

'Tuesday'

In [194]:
days_dict={}
for day_no in range(0,7):
    days_dict[day_name[day_no]]=day_no+1

In [195]:
days_dict

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [196]:
data['weekday_ordinal']=data['Day_Names'].map(days_dict)

In [197]:
data.head()

                         Day  Day_Names  weekday_ordinal
0 2020-07-16 06:48:47.347431   Thursday                4
1 2020-07-15 06:48:47.347431  Wednesday                3
2 2020-07-14 06:48:47.347431    Tuesday                2
3 2020-07-13 06:48:47.347431     Monday                1
4 2020-07-12 06:48:47.347431     Sunday                7

In [94]:
train_set=pd.read_csv(r'C:\Users\Mohit\Desktop\Sample Files\titanic\train.csv',header=None)
train_set.dropna(axis=0,inplace=True)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
4,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S
7,7,0,1,"McCarthy, Mr. Timothy J",male,54,0,0,17463,51.8625,E46,S
11,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4,1,1,PP 9549,16.7,G6,S

In [95]:
columns=[3,8,11,10]

In [96]:
training_set=train_set[columns]

In [97]:
training_set.head()

,3,8,11,10
0,Name,Ticket,Embarked,Cabin
2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",PC 17599,C,C85
4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",113803,S,C123
7,"McCarthy, Mr. Timothy J",17463,S,E46
11,"Sandstrom, Miss. Marguerite Rut",PP 9549,S,G6

In [98]:
for feature in training_set.columns[:]:
    print(feature,":",len(training_set[feature].unique()),'labels')

3 : 184 labels
8 : 128 labels
11 : 4 labels
10 : 134 labels

# Count of Frequency Label

In [99]:
training_set[10].value_counts()

C23 C25 C27    4
B96 B98        4
G6             4
D              3
C22 C26        3
              ..
C7             1
C52            1
D15            1
A16            1
C110           1
Name: 10, Length: 134, dtype: int64

In [100]:
cabin_map=training_set[10].value_counts().to_dict()

In [101]:
training_set['Cabin_Mapped']=training_set[10].map(cabin_map)

c:\users\mohit\appdata\local\programs\python\python36-32\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [102]:
training_set['Cabin_Mapped'].head()

0     1
2     1
4     2
7     1
11    4
Name: Cabin_Mapped, dtype: int64

# Advantages :

In [103]:
# Easy to use : 
# 1. we are not increasing the feature space
# 2. Easy to use

# Disadvantages :

In [104]:
# It will provide the same weight if the frequences are same

# Target Guided - Ordinal Encoding

In [ ]:
# ordering the labls accrding to the target
# Replace the lables with the joint probabiity of 0 and 1

In [ ]:
df=pd.read_csv(r'C:\Users\Mohit\Desktop\Sample Files\adultdata.csv')

In [106]:
df.head()

,17,?,304873,10th,6,Never-married,?.1,Own-child,White,Female,34095,0,32,United-States,<=50K
0,17,Private,65368,11th,7,Never-married,Sales,Own-child,White,Female,0,0,12,United-States,<=50K
1,17,Private,245918,11th,7,Never-married,Other-service,Own-child,White,Male,0,0,12,United-States,<=50K
2,17,Private,191260,9th,5,Never-married,Other-service,Own-child,White,Male,1055,0,24,United-States,<=50K
3,17,Private,270942,5th-6th,3,Never-married,Other-service,Other-relative,White,Male,0,0,48,Mexico,<=50K
4,17,Private,89821,11th,7,Never-married,Other-service,Own-child,White,Male,0,0,10,United-States,<=50K

In [108]:
tit_df=pd.read_csv(r'C:\Users\Mohit\Desktop\Sample Files\titanic\train.csv',usecols=['Cabin','Survived'])

In [109]:
tit_df['Cabin'].fillna('Missing',inplace=True)

In [110]:
tit_df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [112]:
tit_df['Cabin']=tit_df['Cabin'].astype(str).str[0]

In [113]:
tit_df['Cabin'].head()

0    M
1    C
2    M
3    C
4    M
Name: Cabin, dtype: object

In [114]:
tit_df.groupby('Cabin')['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [117]:
ordinal_labels=tit_df.groupby('Cabin')['Survived'].mean().sort_values().index

In [118]:
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [121]:
encoder={k:i for i,k in enumerate(ordinal_labels,0)}

In [124]:
tit_df['Cabin_Ordinal_labels']=tit_df['Cabin'].map(encoder)

In [125]:
tit_df.head()

   Survived Cabin  Cabin_Ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

 # Mean - Encoding

In [126]:
mean_ordinal=tit_df.groupby('Cabin')['Survived'].mean().to_dict()

In [127]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [128]:
tit_df['Cabin_Mean Ordinal Encode']=tit_df['Cabin'].map(mean_ordinal)

In [129]:
tit_df.head()

   Survived Cabin  Cabin_Ordinal_labels  Cabin_Mean Ordinal Encode
0         0     M                     1                   0.299854
1         1     C                     4                   0.593220
2         1     M                     1                   0.299854
3         1     C                     4                   0.593220
4         0     M                     1                   0.299854